{
  "art": [
    {
      "url": "/art/1frieren.png",
      "alt": "Digital art of Frieren from the anime Frieren: Beyond Journey's End laying in a field of blue flowers"
    },
    {
      "url": "/art/Illustration8.png",
      "alt": "Digital art of characters from the videogame Hades. Depicts Zagreus walking into the Colosseum at the end of Elysium and he sees Theseus and Asterius sparkling and muscle posing as they wait for him to arrive."
    },
    {
      "url": "/art/Illustration12.png",
      "alt": "Digital art of Hatsune Miku in the outfit she wears in her Puss n' Boots figure. Her arms are flailing out and she is kicking her leg forward."
    },
    {
      "url": "/art/pomni.png",
      "alt": "Digital art of Pomni from the animated series 'Amazing Digital Circus'. She is playing Dance Dance Revolution. Parody of a page from the manga Chainsaw Man."
    },
    {
      "url": "/art/Illustration4.png",
      "alt": "Digital art of characters from the videogame Hades. Depicts Zagreus and Megaera in Zagreus's bed. Megaera is applying lipstick on Zagreus, who is smiling."
    },
    {
      "url": "/art/Illustration40.png",
      "alt": "Digital art of Laios and Kabru from the manga Dungeon Meshi. They are laying in bed together with the light reflecting on them through a window. Laios is laying on Kabru and snoring; Kabru looks annoyed."
    },
    {
      "url": "/art/Comic11.png",
      "alt": "Digital art of Marcille and Falin from the manga Dungeon Meshi. Marcille is sitting in a dress in a flowery field of grass and can be seen in the center of a golden frame propped on the ground. Falin, also wearing a dress, is leaning in for a kiss."
    }
  ],
  "code": [
    {
      "title": "Birthday discord bot",
      "siteLink": "https://discord.com/oauth2/authorize?client_id=1435100464348663890",
      "thumbnail": {
        "src": "/coding/discord.png",
        "alt": "Discord app logo"
      },
      "githubLink": "https://github.com/katchamari/discord-markiplier-birthday-bot",
      "body": [
        {
          "type": "heading",
          "content": ["Objective"]
        },
        {
          "type": "text",
          "content": [
            "I started working on this project for fun because one of my friends couldn't find an existing bot that she liked. The main goal was to have a bot where you could save the birthdays of people in the server with a slash command. When the day hits, the bot sends out a message letting everyone know it's that person's birthday. The birthday person also gets a special birthday role."
          ]
        },
        {
          "type": "heading",
          "content": ["Core features"]
        },
        {
          "type": "list",
          "content": [
            "NodeJS server with discord.js and mongoose installed",
            "Discord bot created through the developer portal, with permissions to use slash commands, manage roles, and send messages",
            "Ability for someone to configure the bot settings to follow appropriate timezone, set birthday role, and set channel that messages should be sent to ",
            "File based slash command integration",
            "MongoDB database to store user birthdays and server specific bot settings",
            "Cron job to check if anyone's birthday is today, send birthday message, if applicable, and add role. Additionally, remove roles when it's no longer person's birthday",
            "Along with the ability to set new birthdays, we also need to be able to delete birthdays and list birthdays"
          ]
        },
        {
          "type": "heading",
          "content": ["Packages used"]
        },
        {
          "type": "list",
          "content": ["dayjs", "discord.js", "dotenv", "mongoose", "node-cron"]
        }
      ],
      "description": "Discord.js bot that sends out messages on the birthdays of server members. User birthdays as well as server timezone can be set via slash commands, and are stored in a MongoDB database that gets queried during a cron job.",
      "tags": [
        "NodeJS",
        "JavaScript",
        "Discord.js",
        "Bot",
        "MongoDB",
        "Cron job",
        "Back end",
        "Services"
      ]
    },
    {
      "title": "Color guessing game",
      "siteLink": "https://katchamari.github.io/color-picker-game/",
      "thumbnail": {
        "src": "/coding/color-game.png",
        "alt": "Screenshot of color picker game"
      },
      "githubLink": "https://github.com/katchamari/color-picker-game",
      "body": [
        { "type": "heading", "content": ["Objective"] },
        {
          "type": "text",
          "content": [
            "I really wanted to create a fun little front end game that utilizes my JavaScript skills. This HTML page allows you to play a color guessing game where you need to correspond the correct color to the given hexadecimal value."
          ]
        },
        {
          "type": "heading",
          "content": ["Basic necessities"]
        },
        {
          "type": "list",
          "content": [
            "HTML, CSS, and JavaScript files",
            "Favicon",
            "Sound Effects"
          ]
        },
        {
          "type": "heading",
          "content": ["Functions needed"]
        },
        {
          "type": "list",
          "content": [
            "Generate random hexadecimal digit",
            "Generate full 6 digit hexadecimal value",
            "Generate given number of hexadecimal values",
            "Set one option as the correct answer",
            "Create colored square",
            "Create grid of given squares",
            "Start new game",
            "User guess",
            "Revealing answers",
            "Show victory screen",
            "Show losing screen",
            "Show 'Play again' prompt"
          ]
        },
        {
          "type": "image",
          "content": [
            "/coding/color-game/1.png",
            "/coding/color-game/2.png",
            "/coding/color-game/3.png",
            "/coding/color-game/4.png",
            "/coding/color-game/5.png"
          ]
        }
      ],
      "description": "Web game where the player is given a hexadecimal color code and then has to guess which of the given colors it corresponds to. Includes instructions on how to read hex colors, and calming sound effects.",
      "tags": [
        "HTML",
        "CSS",
        "JavaScript",
        "Modals",
        "Audio",
        "Front end",
        "Responsive"
      ]
    },
    {
      "title": "Portfolio site",
      "thumbnail": {
        "src": "/coding/portfolio-site.png",
        "alt": "Screenshot of portfolio site"
      },
      "githubLink": "https://github.com/katchamari/portfolio-site",
      "body": [
        { "type": "heading", "content": ["Objective"] },
        {
          "type": "text",
          "content": [
            "I needed a website to showcase my programming and digital art portfolios. I really wanted to use NextJS with seamless page transitions."
          ]
        },
        {
          "type": "heading",
          "content": ["Core features"]
        },
        {
          "type": "list",
          "content": [
            "NextJS site done with TypeScript",
            "Tabular navigation with NextJS routing",
            "Page transitions and animations with Motion.js",
            "All module css, no Tailwind",
            "Display coding projects in a list, each with links to their own pages of content and media and tags",
            "Display art pieces in grid, each popping up a larger image when clicking",
            "Show skills, qualifications, bio, and provide download to resume"
          ]
        }
      ],
      "description": "My portfolio site. The one you're currently viewing! Done from scratch using NextJS and CSS modules.",
      "tags": [
        "HTML",
        "CSS",
        "JavaScript",
        "ReactJS",
        "NextJS",
        "Animations",
        "Page Transitions",
        "Motion.js",
        "Front end",
        "Responsive"
      ]
    },
    {
      "title": "2Leaf Business Site",
      "thumbnail": {
        "src": "/coding/2leaf.png",
        "alt": "Screenshot of 2Leaf site"
      },
      "siteLink": "https://2leaf.com",
      "body": [
        { "type": "heading", "content": ["Objective"] },
        {
          "type": "text",
          "content": [
            "During my employment with 2Leaf Web Development, I was tasked to develop the new design for the company website. The site should be fully responsive and display the business's members,  services, and portfolio items."
          ]
        },
        {
          "type": "heading",
          "content": ["Core features"]
        },
        {
          "type": "list",
          "content": [
            "Home, Portfolio, About, Services, and Contact pages",
            "Display photos of team members in slideshow",
            "Showcase all portfolio items, each with individual pages",
            "Advertise services and plans",
            "Display contact information and contact form handled with PHP",
            "List open positions for employment with PHP application form"
          ]
        },
        {
          "type": "image",
          "content": [
            "/coding/2leaf/1.png",
            "/coding/2leaf/2.png",
            "/coding/2leaf/3.png",
            "/coding/2leaf/4.png",
            "/coding/2leaf/5.png",
            "/coding/2leaf/6.png"
          ]
        }
      ],
      "description": "Business website for 2Leaf Web Development done in HTML, CSS, JavaScript, Bootstrap, and PHP",
      "tags": [
        "HTML",
        "CSS",
        "JavaScript",
        "jQuery",
        "Bootstrap",
        "PHP",
        "Responsive",
        "Sliders"
      ]
    },
    {
      "title": "The Aquaya Institute",
      "thumbnail": {
        "src": "/coding/aquaya/1.png",
        "alt": "Screenshot of Aquaya.org site"
      },
      "siteLink": "https://aquaya.org",
      "body": [
        { "type": "heading", "content": ["Objective"] },
        {
          "type": "text",
          "content": [
            "During my employment with 2Leaf Web Development, I was tasked to develop the new website for a non-profit called The Aquaya Institute, from designs given to us by the client. The site needed to be integrated with Wordpress and a working blog, and have several specific animations. Coded with HTML, CSS, JavaScript/jQuery, Bootstrap, and PHP for Wordpress integration."
          ]
        },
        {
          "type": "heading",
          "content": ["Core features"]
        },
        {
          "type": "list",
          "content": [
            "Home, several various organization pages, about page, page about a specific project called Project W, and contact page",
            "Several animations across all pages, along with each section fading in on scroll",
            "Fully responsive to all screen sizes",
            "Custom blog page handled with Wordpress custom post types, different categories, and a search",
            "Contact and newsletter signup forms custom coded and then and handled through Wordpress",
            "Home page previewing the most recent posts, animated statistics, and featured collaborators"
          ]
        },
        {
          "type": "image",
          "content": [
            "/coding/aquaya/1.png",
            "/coding/aquaya/2.png",
            "/coding/aquaya/3.png",
            "/coding/aquaya/4.png",
            "/coding/aquaya/5.png",
            "/coding/aquaya/6.png",
            "/coding/aquaya/7.png",
            "/coding/aquaya/8.png",
            "/coding/aquaya/9.png",
            "/coding/aquaya/10.png",
            "/coding/aquaya/11.png",
            "/coding/aquaya/12.png",
            "/coding/aquaya/13.png"
          ]
        }
      ],
      "description": "Wordpress site for non-profit that works in researching and delivering insights and tools regarding universal access to clean and safe water.",
      "tags": [
        "HTML",
        "CSS",
        "JavaScript",
        "jQuery",
        "Bootstrap",
        "PHP",
        "Wordpress",
        "Newsletter",
        "Forms",
        "Animations",
        "Sliders",
        "Blog"
      ]
    }
  ]
}
